Autodesk.Revit.DB.CurveLoopsProfile.Profile
Returns the curve loops of the profile.
Remarks: This property is used to retrieve the curve loops of profile.

Autodesk.Revit.DB.CurveLoopsProfile
Represents a curve loop based profile for sweep or swept blend elements.
Remarks: Use objects of this type in methods as NewSweep() and NewSweptBlend() in Autodesk.Revit.Creation.FamilyItemFactory
to create the profile.